tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "heroku/brew"
tap "joshuaclayton/formulae"
tap "sambadevi/powerlevel9k"

brew "mas"
mas "Xcode", id: 497799835

# git
brew "git"
brew "git-extras"
brew "git-lfs"

# security
brew "gnupg"
brew "openssl"
brew "openssh"

# language version manager
brew "anyenv"

# languages
brew "r"

# editors
brew "micro"
cask "sublime-text"

# cloud providers
brew "heroku"
brew "heroku-node"
cask "google-cloud-sdk"
brew "azure-cli"
brew "awscli"

# docker
cask 'docker'
cask 'xquartz'

# kubernetes
cask "minikube"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kubectx"
brew "kompose"
brew "kubespy"

# infrastructure as code
brew "pulumi"

#build tools
brew "cmake"

# package managers
brew "yarn"

# automated browser
# Selenium webdriver for Chrome browser
cask "chromedriver"

# images and videos
brew "ffmpeg"
brew "imagemagick"

# graphical computation
brew "readline"
brew "graphviz"

# databases
brew "mysql"
brew "postgresql"

# database admin
cask "sequel-pro"
cask "robo-3t"

# admin tools
brew "grep"
brew "htop"
brew "tree"
brew "wget"
brew "whois"
brew "speedtest-cli"

# utils
cask "the-unarchiver"

# p2p
cask "webtorrent"

# browser
cask "google-chrome"

# vpn
cask "nordvpn"

# media
cask "vlc"

# menu bar
mas "MenuBar Stats", id: 714196447
mas "Divvy", id: 413857545
mas "Aware", id: 1082170746

# security
mas "Airmail", id: 918858936
mas "1Password 7", id: 1333542190
cask "nordvpn"

# apple office
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694

# productivity
mas "Bear", id: 1091189122
mas "MindNode", id: 1289197285

# design
cask "figma"

# graphql
cask "graphql-playground"

# ide
cask "rstudio"
cask "mactex"
cask "webstorm"
cask "pycharm"
cask "clion"
cask "rubymine"
cask "datagrip"

# communication
cask "signal"
mas "WhatsApp", id: 1147396723
mas "Slack", id: 803453959