tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/bundle"

# tor
brew "tor"
brew "nyx"
brew "ooniprobe"

# monitoring
brew "netdata"

# git
brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-standup"
brew "karn"

# security
brew "gnupg"
brew "openssl"
brew "openssh"

# editor and envs
brew "micro"
brew "anyenv"

# cloud providers
brew "heroku"
brew "azure-cli"
brew "awscli"
brew "google-cloud-sdk"

# repo providers
brew "hub"

# docker
brew "docker"
brew "docker-compose"
brew "docker-machine"
cask 'docker'

# kubernetes
cask "minikube"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kubectx"
brew "kompose" # convert docker-compose to kubernetes
brew "kubespy" # observe kubernetes' resources in real time

# infrastructure as code
brew "pulumi"

# yarn
brew "yarn"

# automated browser
# Selenium webdriver for Chrome browser
cask "chromedriver"

# images and videos
brew "ffmpeg"
brew "imagemagick"

# databases
brew "sqlite"
brew "mysql", restart_service: true
brew "postgresql", restart_service: true
brew "mongodb", restart_service: true
brew "neo4j", restart_service: true

# other services
brew "nginx", restart_service: true
brew "redis", restart_service: true
brew "elasticsearch", restart_service: true
brew "kibana", restart_service: true
brew "metricbeat", restart_service: true
brew "rabbitmq", restart_service: true
brew "kafka", restart_service: true

# admin tools
brew "grep"
brew "rsync"
brew "htop"
brew "multitail"
brew "rsyslog"
brew "tree"
brew "wget"
brew "whois"
brew "speedtest-cli"

# packets
brew "tcpdump"
brew "ngrep"
brew "wireshark"

# scan ports
brew "nmap"
brew "masscan"
brew "netcat"
brew "socat"

# forensics
brew "sleuthkit"
brew "authopsy"

# passwords
brew "hashcat"
brew "aircrack-ng"
brew "reaver"
brew "truecrack"

# p2p
brew "ipfs"
brew "webtorrent-cli"
cask "webtorrent"

# IM
cask "signal"
cask "zoomus"
# cask "google-hangouts"
# cask "slack"

# browser
cask "google-chrome"

# vpn
cask "nordvpn"

# media
cask "vlc"

# network monitoring
# cask "wireshark"
# cask "metasploit"

# management
brew "tasksh"

# apps from apple store
mas "onepassword7", id: 1333542190
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Xcode", id: 497799835
mas "bear", id: 1091189122
mas "Divvy", id: 413857545
mas "slackmacgap", id: 803453959

cask "webstorm"
cask "datagrip"
cask "rubymine"

cask "robo-3t"
cask "sequel-pro"
cask "zeplin"
